# NumPy and Pandas

In [2]:
import numpy as np

In [3]:
x = np.arange(1,100)
np.std(x)

28.577380332470412

In [4]:
np.random.random(4)

array([0.55161611, 0.88451096, 0.36778826, 0.05945769])

In [5]:
np.random.randn(4)

array([1.14947919, 0.7519652 , 0.04689184, 0.26933347])

In [6]:
np.random.randint(1,11,4)

array([6, 3, 3, 2])

In [7]:
a = np.arange(10)
print(a)
a.dtype

[0 1 2 3 4 5 6 7 8 9]

dtype('int64')

In [8]:
a = np.arange(10, dtype=np.float64)
print(a)
a.dtype

[0. 1. 2. 3. 4. 5. 6. 7. 8. 9.]

dtype('float64')

In [9]:
np.array([1+3j]).dtype

dtype('complex128')

In [10]:
np.array([True, False]).dtype

dtype('bool')

In [11]:
np.array(["Hello", "World!"]).dtype

dtype('<U6')

In [12]:
x

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34,
       35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51,
       52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68,
       69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85,
       86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99])

In [13]:
x[98] = 1000
print(x)

[   1    2    3    4    5    6    7    8    9   10   11   12   13   14
   15   16   17   18   19   20   21   22   23   24   25   26   27   28
   29   30   31   32   33   34   35   36   37   38   39   40   41   42
   43   44   45   46   47   48   49   50   51   52   53   54   55   56
   57   58   59   60   61   62   63   64   65   66   67   68   69   70
   71   72   73   74   75   76   77   78   79   80   81   82   83   84
   85   86   87   88   89   90   91   92   93   94   95   96   97   98
 1000]

In [14]:
y = x[::2]
y

array([   1,    3,    5,    7,    9,   11,   13,   15,   17,   19,   21,
         23,   25,   27,   29,   31,   33,   35,   37,   39,   41,   43,
         45,   47,   49,   51,   53,   55,   57,   59,   61,   63,   65,
         67,   69,   71,   73,   75,   77,   79,   81,   83,   85,   87,
         89,   91,   93,   95,   97, 1000])

In [15]:
x[::-2]

array([1000,   97,   95,   93,   91,   89,   87,   85,   83,   81,   79,
         77,   75,   73,   71,   69,   67,   65,   63,   61,   59,   57,
         55,   53,   51,   49,   47,   45,   43,   41,   39,   37,   35,
         33,   31,   29,   27,   25,   23,   21,   19,   17,   15,   13,
         11,    9,    7,    5,    3,    1])

In [16]:
x[::2][::-1]

array([1000,   97,   95,   93,   91,   89,   87,   85,   83,   81,   79,
         77,   75,   73,   71,   69,   67,   65,   63,   61,   59,   57,
         55,   53,   51,   49,   47,   45,   43,   41,   39,   37,   35,
         33,   31,   29,   27,   25,   23,   21,   19,   17,   15,   13,
         11,    9,    7,    5,    3,    1])

In [17]:
x[::2][::-1][::-1]

array([   1,    3,    5,    7,    9,   11,   13,   15,   17,   19,   21,
         23,   25,   27,   29,   31,   33,   35,   37,   39,   41,   43,
         45,   47,   49,   51,   53,   55,   57,   59,   61,   63,   65,
         67,   69,   71,   73,   75,   77,   79,   81,   83,   85,   87,
         89,   91,   93,   95,   97, 1000])

In [18]:
np.shares_memory(x,y)

True

In [19]:
z = x[::2].copy()
z

array([   1,    3,    5,    7,    9,   11,   13,   15,   17,   19,   21,
         23,   25,   27,   29,   31,   33,   35,   37,   39,   41,   43,
         45,   47,   49,   51,   53,   55,   57,   59,   61,   63,   65,
         67,   69,   71,   73,   75,   77,   79,   81,   83,   85,   87,
         89,   91,   93,   95,   97, 1000])

In [20]:
np.shares_memory(x,z)

False

In [21]:
a = np.arange(1,7).reshape(3,2)
a

array([[1, 2],
       [3, 4],
       [5, 6]])

In [22]:
b = np.arange(7,13).reshape(3,2)
b

array([[ 7,  8],
       [ 9, 10],
       [11, 12]])

In [23]:
vertical_stack = np.vstack((a,b))
vertical_stack

array([[ 1,  2],
       [ 3,  4],
       [ 5,  6],
       [ 7,  8],
       [ 9, 10],
       [11, 12]])

In [24]:
horizontal_stack = np.hstack((a,b))
horizontal_stack

array([[ 1,  2,  7,  8],
       [ 3,  4,  9, 10],
       [ 5,  6, 11, 12]])

In [25]:
vertical_concat = np.concatenate([a,b], axis=1)
vertical_concat

array([[ 1,  2,  7,  8],
       [ 3,  4,  9, 10],
       [ 5,  6, 11, 12]])

In [26]:
a.T

array([[1, 3, 5],
       [2, 4, 6]])

In [27]:
np.dot(a, a.T)

array([[ 5, 11, 17],
       [11, 25, 39],
       [17, 39, 61]])

Pandas

In [28]:
import pandas as pd

In [29]:
weather_data = {("1/1/2024",32,6,"rain"),
               ("2/1/2024",35,7,"sunny")}

In [30]:
df = pd.DataFrame(weather_data, 
                  columns=["Date","Temp","Wind","Climate"])
df

       Date  Temp  Wind Climate
0  2/1/2024    35     7   sunny
1  1/1/2024    32     6    rain

In [31]:
df.shape

(2, 4)

In [32]:
df.head

<bound method NDFrame.head of        Date  Temp  Wind Climate
0  2/1/2024    35     7   sunny
1  1/1/2024    32     6    rain>

In [33]:
df = pd.read_csv("auto-mpg.csv")

In [37]:
df.shape

(398, 9)

In [40]:
df.head(2)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320

In [41]:
df.tail(2)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
396,28.0,4,120.0,79,2625,18.6,82,1,ford ranger
397,31.0,4,119.0,82,2720,19.4,82,1,chevy s-10

In [44]:
df["mpg"]

0      18.0
1      15.0
2      18.0
3      16.0
4      17.0
       ...
393    27.0
394    44.0
395    32.0
396    28.0
397    31.0
Name: mpg, Length: 398, dtype: float64

In [45]:
df.mpg

0      18.0
1      15.0
2      18.0
3      16.0
4      17.0
       ...
393    27.0
394    44.0
395    32.0
396    28.0
397    31.0
Name: mpg, Length: 398, dtype: float64

In [50]:
df[["mpg", "car name"]]

      mpg                   car name
0    18.0  chevrolet chevelle malibu
1    15.0          buick skylark 320
2    18.0         plymouth satellite
3    16.0              amc rebel sst
4    17.0                ford torino
..    ...                        ...
393  27.0            ford mustang gl
394  44.0                  vw pickup
395  32.0              dodge rampage
396  28.0                ford ranger
397  31.0                 chevy s-10

[398 rows x 2 columns]

In [49]:
df.columns.tolist()

['mpg',
 'cylinders',
 'displacement',
 'horsepower',
 'weight',
 'acceleration',
 'model year',
 'origin',
 'car name']

In [39]:
df.describe

<bound method NDFrame.describe of       mpg  cylinders  displacement horsepower  weight  acceleration  \
0    18.0          8         307.0        130    3504          12.0
1    15.0          8         350.0        165    3693          11.5
2    18.0          8         318.0        150    3436          11.0
3    16.0          8         304.0        150    3433          12.0
4    17.0          8         302.0        140    3449          10.5
..    ...        ...           ...        ...     ...           ...
393  27.0          4         140.0         86    2790          15.6
394  44.0          4          97.0         52    2130          24.6
395  32.0          4         135.0         84    2295          11.6
396  28.0          4         120.0         79    2625          18.6
397  31.0          4         119.0         82    2720          19.4

     model year  origin                   car name
0            70       1  chevrolet chevelle malibu
1            70       1          buick skylark 320
2            70       1         plymouth satellite
3            70       1              amc rebel sst
4            70       1                ford torino
..          ...     ...                        ...
393          82       1            ford mustang gl
394          82       2                  vw pickup
395          82       1              dodge rampage
396          82       1                ford ranger
397          82       1                 chevy s-10

[398 rows x 9 columns]>

In [51]:
new_df = df[["mpg", "car name"]]

In [55]:
new_df.to_csv("new-auto-mpg.csv")

In [56]:
df.sample(10)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
184,25.0,4,140.0,92,2572,14.9,76,1,capri ii
347,37.0,4,85.0,65,1975,19.4,81,3,datsun 210 mpg
340,25.8,4,156.0,92,2620,14.4,81,1,dodge aries wagon (sw)
121,15.0,8,318.0,150,3399,11.0,73,1,dodge dart custom
71,19.0,3,70.0,97,2330,13.5,72,3,mazda rx2 coupe
269,30.9,4,105.0,75,2230,14.5,78,1,dodge omni
81,28.0,4,97.0,92,2288,17.0,72,3,datsun 510 (sw)
34,16.0,6,225.0,105,3439,15.5,71,1,plymouth satellite custom
260,18.6,6,225.0,110,3620,18.7,78,1,dodge aspen
395,32.0,4,135.0,84,2295,11.6,82,1,dodge rampage

In [57]:
df.sample(frac=0.2)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
283,20.2,6,232.0,90,3265,18.2,79,1,amc concord dl 6
100,18.0,6,250.0,88,3021,16.5,73,1,ford maverick
280,21.5,6,231.0,115,3245,15.4,79,1,pontiac lemans v6
209,19.0,4,120.0,88,3270,21.9,76,2,peugeot 504
49,23.0,4,122.0,86,2220,14.0,71,1,mercury capri 2000
...,...,...,...,...,...,...,...,...,...
11,14.0,8,340.0,160,3609,8.0,70,1,plymouth 'cuda 340
143,26.0,4,97.0,78,2300,14.5,74,2,opel manta
233,29.0,4,97.0,78,1940,14.5,77,2,volkswagen rabbit custom
380,36.0,4,120.0,88,2160,14.5,82,3,nissan stanza xe
316,19.1,6,225.0,90,3381,18.7,80,1,dodge aspen

In [60]:
g = df.groupby("model year")
g

In [62]:
g.max()

,mpg,cylinders,displacement,horsepower,weight,acceleration,origin,car name
model year,,,,,,,,
70,27.0,8,455.0,97,4732,20.5,3,volkswagen 1131 deluxe sedan
71,35.0,8,400.0,?,5140,20.5,3,volkswagen model 111
72,28.0,8,429.0,97,4633,23.5,3,volvo 145e (sw)
73,29.0,8,455.0,95,4997,21.0,3,volvo 144ea
74,32.0,8,350.0,?,4699,21.0,3,volkswagen dasher
75,33.0,8,400.0,98,4668,21.0,3,volvo 244dl
76,33.0,8,351.0,95,4380,22.2,3,vw rabbit
77,36.0,8,400.0,98,4335,19.0,3,volkswagen rabbit custom
78,43.1,8,318.0,97,4080,21.5,3,volvo 264gl
79,37.3,8,360.0,90,4360,24.8,3,vw rabbit custom
80,46.6,6,225.0,?,3381,23.7,3,vw rabbit c (diesel)
81,39.1,8,350.0,?,3725,20.7,3,volvo diesel
82,44.0,6,262.0,?,3035,24.6,3,vw pickup

In [74]:
us_weather = pd.DataFrame({
    "city":["NY","Chicago","Seatle"],
    "Temp":[21,15,35],
    "Humidity":[68,65,75]
})
us_weather

      city  Temp  Humidity
0       NY    21        68
1  Chicago    15        65
2   Seatle    35        75

In [75]:
india_weather = pd.DataFrame({
    "city":["Kerala","Goa","Delhi"],
    "Temp":[37,21,35],
    "Humidity":[64,69,58]
})
india_weather

     city  Temp  Humidity
0  Kerala    37        64
1     Goa    21        69
2   Delhi    35        58

In [76]:
weather_us_india = pd.concat([us_weather, india_weather], ignore_index=True)
weather_us_india

      city  Temp  Humidity
0       NY    21        68
1  Chicago    15        65
2   Seatle    35        75
3   Kerala    37        64
4      Goa    21        69
5    Delhi    35        58

In [77]:
weather_us_india["Temp"]<30

0     True
1     True
2    False
3    False
4     True
5    False
Name: Temp, dtype: bool

In [78]:
weather_us_india[weather_us_india["Temp"]<30]

      city  Temp  Humidity
0       NY    21        68
1  Chicago    15        65
4      Goa    21        69

In [79]:
pd.concat([us_weather, india_weather], axis=1)

      city  Temp  Humidity    city  Temp  Humidity
0       NY    21        68  Kerala    37        64
1  Chicago    15        65     Goa    21        69
2   Seatle    35        75   Delhi    35        58

In [83]:
pd.merge(us_weather, india_weather, on="Temp")

   city_x  Temp  Humidity_x city_y  Humidity_y
0      NY    21          68    Goa          69
1  Seatle    35          75  Delhi          58

In [88]:
df_index = pd.DataFrame([1,2,3,4], index=[49,48,12,3])
df_index

    0
49  1
48  2
12  3
3   4

In [93]:
df_index.loc[49]

0    1
Name: 49, dtype: int64

In [94]:
df_index.iloc[2]

0    3
Name: 12, dtype: int64

In [103]:
city1 = pd.Series([12, -6,8,-3], index=["day1", "day2", "day3", "day4"])
city1

day1    12
day2
day3     8
day4    -3
dtype: object

In [104]:
city1.isna()

day1    False
day2    False
day3    False
day4    False
dtype: bool

In [97]:
city1.isna().sum()

0

In [105]:
df["car name"].unique()

array(['chevrolet chevelle malibu', 'buick skylark 320',
       'plymouth satellite', 'amc rebel sst', 'ford torino',
       'ford galaxie 500', 'chevrolet impala', 'plymouth fury iii',
       'pontiac catalina', 'amc ambassador dpl', 'dodge challenger se',
       "plymouth 'cuda 340", 'chevrolet monte carlo',
       'buick estate wagon (sw)', 'toyota corona mark ii',
       'plymouth duster', 'amc hornet', 'ford maverick', 'datsun pl510',
       'volkswagen 1131 deluxe sedan', 'peugeot 504', 'audi 100 ls',
       'saab 99e', 'bmw 2002', 'amc gremlin', 'ford f250', 'chevy c20',
       'dodge d200', 'hi 1200d', 'chevrolet vega 2300', 'toyota corona',
       'ford pinto', 'plymouth satellite custom', 'ford torino 500',
       'amc matador', 'pontiac catalina brougham', 'dodge monaco (sw)',
       'ford country squire (sw)', 'pontiac safari (sw)',
       'amc hornet sportabout (sw)', 'chevrolet vega (sw)',
       'pontiac firebird', 'ford mustang', 'mercury capri 2000',
       'opel 1900', 'peugeot 304', 'fiat 124b', 'toyota corolla 1200',
       'datsun 1200', 'volkswagen model 111', 'plymouth cricket',
       'toyota corona hardtop', 'dodge colt hardtop', 'volkswagen type 3',
       'chevrolet vega', 'ford pinto runabout', 'amc ambassador sst',
       'mercury marquis', 'buick lesabre custom',
       'oldsmobile delta 88 royale', 'chrysler newport royal',
       'mazda rx2 coupe', 'amc matador (sw)',
       'chevrolet chevelle concours (sw)', 'ford gran torino (sw)',
       'plymouth satellite custom (sw)', 'volvo 145e (sw)',
       'volkswagen 411 (sw)', 'peugeot 504 (sw)', 'renault 12 (sw)',
       'ford pinto (sw)', 'datsun 510 (sw)',
       'toyouta corona mark ii (sw)', 'dodge colt (sw)',
       'toyota corolla 1600 (sw)', 'buick century 350',
       'chevrolet malibu', 'ford gran torino', 'dodge coronet custom',
       'mercury marquis brougham', 'chevrolet caprice classic',
       'ford ltd', 'plymouth fury gran sedan',
       'chrysler new yorker brougham', 'buick electra 225 custom',
       'amc ambassador brougham', 'plymouth valiant',
       'chevrolet nova custom', 'volkswagen super beetle', 'ford country',
       'plymouth custom suburb', 'oldsmobile vista cruiser',
       'toyota carina', 'datsun 610', 'maxda rx3', 'mercury capri v6',
       'fiat 124 sport coupe', 'chevrolet monte carlo s',
       'pontiac grand prix', 'fiat 128', 'opel manta', 'audi 100ls',
       'volvo 144ea', 'dodge dart custom', 'saab 99le', 'toyota mark ii',
       'oldsmobile omega', 'chevrolet nova', 'datsun b210',
       'chevrolet chevelle malibu classic', 'plymouth satellite sebring',
       'buick century luxus (sw)', 'dodge coronet custom (sw)',
       'audi fox', 'volkswagen dasher', 'datsun 710', 'dodge colt',
       'fiat 124 tc', 'honda civic', 'subaru', 'fiat x1.9',
       'plymouth valiant custom', 'mercury monarch', 'chevrolet bel air',
       'plymouth grand fury', 'buick century',
       'chevroelt chevelle malibu', 'plymouth fury', 'buick skyhawk',
       'chevrolet monza 2+2', 'ford mustang ii', 'toyota corolla',
       'pontiac astro', 'volkswagen rabbit', 'amc pacer', 'volvo 244dl',
       'honda civic cvcc', 'fiat 131', 'capri ii', 'renault 12tl',
       'dodge coronet brougham', 'chevrolet chevette', 'chevrolet woody',
       'vw rabbit', 'dodge aspen se', 'ford granada ghia',
       'pontiac ventura sj', 'amc pacer d/l', 'datsun b-210', 'volvo 245',
       'plymouth volare premier v8', 'mercedes-benz 280s',
       'cadillac seville', 'chevy c10', 'ford f108', 'dodge d100',
       'honda accord cvcc', 'buick opel isuzu deluxe', 'renault 5 gtl',
       'plymouth arrow gs', 'datsun f-10 hatchback',
       'oldsmobile cutlass supreme', 'dodge monaco brougham',
       'mercury cougar brougham', 'chevrolet concours', 'buick skylark',
       'plymouth volare custom', 'ford granada', 'pontiac grand prix lj',
       'chevrolet monte carlo landau', 'chrysler cordoba',
       'ford thunderbird', 'volkswagen rabbit custom',
       'pontiac sunbird coupe', 'toyota corolla liftback',
       'ford mustang ii 2+2', 'dodge colt m/m', 'subaru dl', 'datsun 810',
       'bmw 320i', 'mazda rx-4', 'volkswagen rabbit custom diesel',
       'ford fiesta', 'mazda glc deluxe', 'datsun b210 gx',
       'oldsmobile cutlass salon brougham', 'dodge diplomat',
       'mercury monarch ghia', 'pontiac phoenix lj',
       'ford fairmont (auto)', 'ford fairmont (man)', 'plymouth volare',
       'amc concord', 'buick century special', 'mercury zephyr',
       'dodge aspen', 'amc concord d/l',
       'buick regal sport coupe (turbo)', 'ford futura',
       'dodge magnum xe', 'datsun 510', 'dodge omni',
       'toyota celica gt liftback', 'plymouth sapporo',
       'oldsmobile starfire sx', 'datsun 200-sx', 'audi 5000',
       'volvo 264gl', 'saab 99gle', 'peugeot 604sl',
       'volkswagen scirocco', 'honda accord lx', 'pontiac lemans v6',
       'mercury zephyr 6', 'ford fairmont 4', 'amc concord dl 6',
       'dodge aspen 6', 'ford ltd landau', 'mercury grand marquis',
       'dodge st. regis', 'chevrolet malibu classic (sw)',
       'chrysler lebaron town @ country (sw)', 'vw rabbit custom',
       'maxda glc deluxe', 'dodge colt hatchback custom', 'amc spirit dl',
       'mercedes benz 300d', 'cadillac eldorado', 'plymouth horizon',
       'plymouth horizon tc3', 'datsun 210', 'fiat strada custom',
       'buick skylark limited', 'chevrolet citation',
       'oldsmobile omega brougham', 'pontiac phoenix',
       'toyota corolla tercel', 'datsun 310', 'ford fairmont',
       'audi 4000', 'toyota corona liftback', 'mazda 626',
       'datsun 510 hatchback', 'mazda glc', 'vw rabbit c (diesel)',
       'vw dasher (diesel)', 'audi 5000s (diesel)', 'mercedes-benz 240d',
       'honda civic 1500 gl', 'renault lecar deluxe', 'vokswagen rabbit',
       'datsun 280-zx', 'mazda rx-7 gs', 'triumph tr7 coupe',
       'ford mustang cobra', 'honda accord', 'plymouth reliant',
       'dodge aries wagon (sw)', 'toyota starlet', 'plymouth champ',
       'honda civic 1300', 'datsun 210 mpg', 'toyota tercel',
       'mazda glc 4', 'plymouth horizon 4', 'ford escort 4w',
       'ford escort 2h', 'volkswagen jetta', 'renault 18i',
       'honda prelude', 'datsun 200sx', 'peugeot 505s turbo diesel',
       'volvo diesel', 'toyota cressida', 'datsun 810 maxima',
       'oldsmobile cutlass ls', 'ford granada gl',
       'chrysler lebaron salon', 'chevrolet cavalier',
       'chevrolet cavalier wagon', 'chevrolet cavalier 2-door',
       'pontiac j2000 se hatchback', 'dodge aries se',
       'ford fairmont futura', 'amc concord dl', 'volkswagen rabbit l',
       'mazda glc custom l', 'mazda glc custom', 'plymouth horizon miser',
       'mercury lynx l', 'nissan stanza xe', 'honda civic (auto)',
       'datsun 310 gx', 'buick century limited',
       'oldsmobile cutlass ciera (diesel)', 'chrysler lebaron medallion',
       'ford granada l', 'toyota celica gt', 'dodge charger 2.2',
       'chevrolet camaro', 'ford mustang gl', 'vw pickup',
       'dodge rampage', 'ford ranger', 'chevy s-10'], dtype=object)

In [107]:
df["cylinders"].value_counts()

cylinders
4    204
8    103
6     84
3      4
5      3
Name: count, dtype: int64

In [112]:
new_cars = df.drop(["origin","car name"], axis=1)
new_cars

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year
0,18.0,8,307.0,130,3504,12.0,70
1,15.0,8,350.0,165,3693,11.5,70
2,18.0,8,318.0,150,3436,11.0,70
3,16.0,8,304.0,150,3433,12.0,70
4,17.0,8,302.0,140,3449,10.5,70
...,...,...,...,...,...,...,...
393,27.0,4,140.0,86,2790,15.6,82
394,44.0,4,97.0,52,2130,24.6,82
395,32.0,4,135.0,84,2295,11.6,82
396,28.0,4,120.0,79,2625,18.6,82
397,31.0,4,119.0,82,2720,19.4,82